'''
本程序为木子编程系列课第七课示例程序
主要引导大家学习：
        异常处理
进一步深入编程世界
'''
import time

#自定义函数
  
'''
睡眠打印字符串方法
msg_str        需要打印输出的字符串
stepTime    输出间隔时间
'''
def print_sleep(msg_str,stepTime):
    time.sleep(stepTime)
    print(msg_str)
    return True
    
'''
展示列表信息方法
msgList        需要打印输出的列表
stepTime    输出间隔时间
'''
def showMsg_list(msgList,stepTime):
    for msg in msgList:
        time.sleep(stepTime)
        print(msg)
    return True

'''
做小测试的方法
question        需要回答的问题
answer           问题的答案
award             答对问题的奖励
'''
def test(question,answer,award):
    print_sleep('^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^',2)
    test1_1 = input(question)
    while test1_1 != answer:
        print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
        test1_1 = input(question)
    print('回答正确!',award)
    print()
    return True

msg_data = '''        算术运算：
\t除:/（有小数）\t取整：//（商的整数部分）\t取模：%（取除法竖式运算的余数部分）\t求幂：**（10**3，结果为：1000，10的3次方）',
        关系运算：判断关系运算符两边数据的关系，运算结果为：True或False。',
        逻辑运算：not、and、or；运算结果为：True或False。',
        赋值运算：（=），符号右侧创建值对象后，将左边的变量与右边的值进行绑定。',
        运算优先级：',
\t算术运算>关系运算>逻辑运算>赋值运算，优先级高的先运算。
'''

msg_if1 = '''------------------  交警独自工作时  ----------------
if 条件:
    支线任务
'''
msg_if2 = '''------------------  交警携带辅警  else  时  ----------------
if 条件:
    支线任务1
else:
    支线任务2
'''
msg_if3 = '''------------------  交警携带多名辅警  else、elif  时  ----------------
if 条件1:
    支线任务1
elif 条件2:
    支线任务2
elif 条件3:
    支线任务3
else:
    支线任务4
'''

msg_while1 = '''----------------  不停判断，不停循环  --------------
while 循环条件：
        循环内容
'''

msg_for1 = '''----------------  依次访问序列中的数据  ----------------
for 循环控制变量 in 序列:
        循环内容
'''

msg_range = '''~~~~~~~~~~~~~~~~~~~~    整数序列  range    ~~~~~~~~~~~~~~~~~~~~
range(start,stop,step) ,
从 start 开始，到小于 stop的最大整数结束，间隔为step。step省略值为1。
'''
msg_list = '''~~~~~~~~~~~~~~~~~~~~    列表 list    ~~~~~~~~~~~~~~~~~~~~
使用一对英文的中括号[  ]，将多个数据围起来
并在中括号中使用英文的逗号，将这多个数据分开
使用下标的方式查找列表数据：list[下标]
有序、可修改、可重复
'''
msg_dict = '''~~~~~~~~~~~~~~~~~~~~    字典 dict   ~~~~~~~~~~~~~~~~~~~~
使用一对英文的大括号{  }，将多个键值对数据围起来
并在大括号中使用英文的逗号，将这多个键值对分开
键值对  写作     键（key） : 值（value）
无序、键唯一
'''
msg_f = '''~~~~~~~~~~~~~~~~~~~~    自定义函数   ~~~~~~~~~~~~~~~~~~~~
    关键字：def
    函数名：与函数功能相关
    参  数：写在函数名后的括号里，多个参数使用英文逗号分开
    返回值：return 函数运行后的结果
    在使用（调用）前定义函数
'''

#前六小节：复习内容引导词
print('勇士，欢迎回到程序世界！')

guide = ['恭喜你来到  第七关  ',
         '在之前的闯关任务中，你已获得：',
         '**********************    超大刀  六  项技能    **********************',
         '分别是：',
         '''~~~~~~~~~~~~~~~~~~~~   注释——不运行的内容  ~~~~~~~~~~~~~~~~~~~~~
         使用一对三引号，对在三引号中间的多行内容进行注释
         使用“#”，对该符号后面的单行内容进行注释''',
         '',
         '''~~~~~~~~~~~~~~~  连接程序世界技能1  ~~~~~~~~~~~~~~~
         输入、输出函数：input()、print()''',
         '',
         '''~~~~~~~~~~~~~~~~~~~   数据类型  ~~~~~~~~~~~~~~~~~~~
         整数类型 int、浮点数类型 float 、布尔类型 bool 、字符串类型 str ''',
         '',
         '''~~~~~~~~~~~~~~~~~~~~   变量  ~~~~~~~~~~~~~~~~~~~~~
         变量通过“=”与数据进行绑定，
         变量名由字母、数字、下划线_组成
         不能已数字开头，不能跟int、float等关键字重名''',
         '',
         '''~~~~~~~~~~~~~~~~~~~   类型转换  ~~~~~~~~~~~~~~~~~~~~
         类型转换函数int()、float()、str()''',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据运算  ~~~~~~~~~~~~~~~~~~~~',
         msg_data,
         '',
         '**********************    法杖   四   项魔法技能    **********************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~    管理支线任务的交警 if    ~~~~~~~~~~~~~~~~~~~~',
         msg_if1,
         msg_if2,
         msg_if3,
         '',
         '~~~~~~~~~~~~~~~~~~~~    条件循环守卫 while    ~~~~~~~~~~~~~~~~~~~~',
         msg_while1,
         '判断条件，满足则执行循环内容，内容执行后，再判断条件，',
         '不满足条件退出循环',
         '',
         '~~~~~~~~~~~~~~~~~~~~    序列循环鸡排哥 for    ~~~~~~~~~~~~~~~~~~~~',
         msg_for1,
         '每次循环，循环控制变量依次绑定序列中的内容',
         '',
         '**********************  链蛇软剑  三项技能  **********************',
         msg_range,
         msg_list,
         msg_dict,
         '**********************  炼器炉  **********************',
         msg_f]

#从引导词列表中逐句打印引导词
showMsg_list(guide,1)

for i in range(5):
    time.sleep(0.5)
    print('咻~~~~~~',end='')
print()
print_sleep('~~~~~~~~~~~~~~~  解锁新道具：拂尘  ~~~~~~~~~~~~~~~',2)
time.sleep(2)
input('勇士！你可以直接按下Enter键开启第七关任务，修炼新道具了。')

#模拟加载画面
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
print()

#语法讲解
msg_list = '''-----------------------  水浒传一百单八将姓名列表 heroes ------------------
heroes = [
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]
'''

#引入异常错误
gramList_intro = [
    '勇士！还记得我们的 一百单八将姓名列表 heroes 吗？',
    msg_list,
    '程序运行过程中如果遇到语句  heroes.index("李二狗") ',
    '会提示错误信息  ValueError: "李二狗"is not in list))#"李二狗"不在列表中',
    '从而导致程序崩溃',
    '程序运行时崩溃，对游戏玩家来说是一件很头疼的事情！',
    '运行时程序崩溃就像打怪时刚好停电，玩家只能被迫停止！'
    ]
showMsg_list(gramList_intro,2.5)
test('程序运行过程中，如果出现异常，程序会崩溃停止(yes/no)？','yes','拂尘净化力+1')

msg_try1 = '''
#~~~~~~~~~~~~~~ 处理异常的格式 ~~~~~~~~~~~~~~
try:
    #尝试执行可能出现异常的代码
except 异常类型:
    #异常出现时执行的代码
'''

msg_try2 = '''
heroes = [
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]

try:
    heroes.index("李二狗")
except ValueError: 
    print('很抱歉，该英雄不是宋江他们一边的。')
'''

gramList_try = [
    '勇士，别担心！程序世界伟大的神能预判这些异常，并巧妙地处理好它。',
    '方法核心原则就是：尝试执行代码，若出现异常则处理，不终止程序',
    msg_try1,
    '所以，当一百单八将姓名列表 heroes 中不确定是否有 "李二狗"',
    '想要程序运行过程中查找"李二狗"下标的语句不报错，导致程序崩溃',
    '可以将查找"李二狗"的语句heroes.index("李二狗") 放入 try 模块中，',
    '此时如果程序出现异常，会执行except模块中的内容，而不会让程序崩溃。',
    msg_try2
    ]
showMsg_list(gramList_try,2.5)
test('在程序中，可能会出现异常的语句，可以放在什么模块下呢？','try','拂尘净化力+1')

msg_try3 = '''
#~~~~~~~~~~~~~~ 处理异常的格式2 ~~~~~~~~~~~~~~
try:
    #尝试执行可能出现异常的代码
except 异常类型:
    #异常出现时执行的代码
else:
    #异常未出现时执行的代码
'''

msg_try4 = '''
heroes = [
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]

hero = input('请输入你想查找的英雄名字：')
try:
    #查找输入的英雄的排序
    _no = heroes.index(hero)
except ValueError:
    print('很抱歉，英雄',hero,'不是宋江他们一边的。')
else:
    print(hero,'在一百单八将中排名是：',_no+1)
    
'''
gramList_tryElse = [
    '当然，如果可能异常的代码顺利运行，没有遇到异常',
    '可以添加 else 模块，将没有遇到异常时的代码放入 else 模块中。',
    '这样，可能出现异常的代码，无论是否遇到异常，都能按正常逻辑运行',
    msg_try3,
    '此时，只要是只要对前面查找"李二狗"序号的程序稍加修改,',
    '即可对任一英雄的排名进行查找',
    msg_try4
    ]
showMsg_list(gramList_tryElse,2.5)
test('在try模块中程序出现异常，会执行哪个模块的内容？','except','拂尘净化力+1')

gramList_errorType = [
    '除了列表下标这样的ValueError错误，常见内置异常类型还有',
    '''
    异常类型\t\t含义\t\t场景举例
    ZeroDivisionError\t\t除零错误\t5 / 0
    IndexError\t\t索引越界\t\t列表下标超出范围
    KeyError\t\t字典键不存在\t字典取不存在的键
    ValueError\t\t值错误\t\t输入字符串转数字失败
    TypeError\t\t类型错误\t\t数字和字符串相加
    ''',
    '按照 try-except 这样的异常捕捉语法格式，',
    '以上可能出现异常的语句均可正常运行,不会导致程序崩溃'
    ]
showMsg_list(gramList_errorType,2.5)

#知识点分割
print_sleep('********************************************************************',2)
print_sleep('恭喜！拂尘净化力已加满！',1)
print_sleep('接下来，你可以选择向系统提问，也可打开新手第六个任务进行训练。',1)
