'''
本程序为木子编程系列课第五课示例程序
主要引导大家学习：
        常用数据结构：列表、字典
帮助同学们对编程打下基础
'''
import time

print('勇士，欢迎回到程序世界！')

msg_if1 = '''------------------  交警独自工作时  ----------------
if 条件:
    支线任务
'''
msg_if2 = '''------------------  交警携带辅警  else  时  ----------------
if 条件:
    支线任务1
else:
    支线任务2
'''
msg_if3 = '''------------------  交警携带多名辅警  else、elif  时  ----------------
if 条件1:
    支线任务1
elif 条件2:
    支线任务2
elif 条件3:
    支线任务3
else:
    支线任务4
'''

msg_while1 = '''----------------  不停判断，不停循环  --------------
while 循环条件：
        循环内容
'''

msg_for1 = '''----------------  依次访问序列中的数据  ----------------
for 循环控制变量 in 序列:
        循环内容
'''
#前四小节：复习内容引导词
guide = ['恭喜你完成新手村前四个任务',
         '***************    你已获得超大刀的  六  项技能    ***************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~   注释——不运行的内容  ~~~~~~~~~~~~~~~~~~~~~',
         '        使用一对三引号，对在三引号中间的多行内容进行注释',
         '        使用“#”，对该符号后面的单行内容进行注释',
         '',
         '~~~~~~~~~~~~~~~  连接程序世界技能1  ~~~~~~~~~~~~~~~',
         '        输入、输出函数：input()、print()',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据类型  ~~~~~~~~~~~~~~~~~~~',
         '        整数类型 int、浮点数类型 float 、布尔类型 bool 、字符串类型 str ',
         '',
         '~~~~~~~~~~~~~~~~~~~~   变量  ~~~~~~~~~~~~~~~~~~~~~',
         '        变量通过“=”与数据进行绑定，',
         '        变量名由字母、数字、下划线_组成',
         '        不能已数字开头，不能跟int、float等关键字重名',
         '',
         '~~~~~~~~~~~~~~~~~~~   类型转换  ~~~~~~~~~~~~~~~~~~~~',
         '        类型转换函数int()、float()、str()',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据运算  ~~~~~~~~~~~~~~~~~~~~',
         '        算术运算：',
         '\t除:/（有小数）、取整：//（商的整数部分）、取模：%（取除法竖式运算的余数部分）',
         '\t求幂：**（10**3，结果为：1000，10的3次方）',
         '        关系运算：判断关系运算符两边数据的关系，运算结果为：True或False。',
         '        逻辑运算：not、and、or；运算结果为：True或False。',
         '        赋值运算：（=），符号右侧创建值对象后，将左边的变量与右边的值进行绑定。',
         '        运算优先级：',
         '\t算术运算>关系运算>逻辑运算>赋值运算，优先级高的先运算。',
         '',
         '***************    法杖的   四   项魔法技能    ***************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~    管理支线任务的交警 if    ~~~~~~~~~~~~~~~~~~~~',
         msg_if1,
         msg_if2,
         msg_if3,
         '',
         '~~~~~~~~~~~~~~~~~~~~    条件循环守卫 while    ~~~~~~~~~~~~~~~~~~~~',
         msg_while1,
         '判断条件，满足则执行循环内容，内容执行后，再判断条件，',
         '不满足条件退出循环',
         '',
         '~~~~~~~~~~~~~~~~~~~~    序列循环鸡排哥 for    ~~~~~~~~~~~~~~~~~~~~',
         msg_for1,
         '每次循环，循环控制变量依次绑定序列中的内容',
         '',
         ''
         ]

#从引导词列表中逐句打印引导词
for guideStr in guide:
    time.sleep(1)
    print(guideStr)

for i in range(6):
    time.sleep(0.5)
    print('嗞~~~~~~',end='')

time.sleep(1)
print()
print()
print('        ~~~~~~~~~~~~    解锁新道具：链蛇软剑！    ~~~~~~~~~~~~')

time.sleep(1)
print()
print('接下来，你可以针对对超大刀的所有技能向公主殿下询问使用方法，')
input('也可直接按下Enter键开启第五关，学习链蛇软剑技能')

#模拟加载画面
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
time.sleep(0.1)
print()

msg_list1 = '''-----------------------  水浒传一百单八将姓名列表 ------------------
[
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]
'''

msg_list2 = '''-----------------------  水浒传一百单八将姓名列表 ------------------
heroes = [
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]
'''
#知识讲解
graList = ['勇士！以往超大刀的变量技能，只能绑定一个数据',
           '比如：',
           'name = "艾莎公主"',
           'age = 18',
           '那类似水浒传一百单八将这么多个名字的数据该如何一次表示呢？',
           '程序世界中，使用一对英文的中括号，将多个数据围起来',
           '并在中括号中使用英文的逗号，将这多个数据分开',
           '比如：',
           msg_list1,
           '这样的数据表示方式，称为 -----------   列表  -----------',
           '如你所见，一个列表里可以存储多个数据',
           '而这一个列表，可以使用一个变量名进行绑定',
           msg_list2,
           '有时候，也会出现更复杂的情况，那就是出现3个以上的岔路口，',
           '显然，1名辅警  else  已经忙不过来了，',
           '需要多名辅警  elif  的协助，',
           '这些辅警  elif  需要协助交警进行数据检查，',
           '不满足交警  if  的条件时，if  会将数据检查交给辅警 elif  ,',
           '满足其中一个辅警 elif  的条件，这个辅警  elif  就会为你放行，执行对应的支线任务。',
           msg_if3,
           '执行一个支线任务后，程序便回到主线任务继续往下执行，',
           '不再继续执行其他支线任务。',
           '程序就是这样勇往之前，不走回头路']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')


#分支结构小测
test1_msg = '''请阅读以下小测试1程序：
if score >= 90:
    print("优秀")\t# 条件1满足时执行
elif score >= 80:
    print("良好")\t# 条件1不满足，条件2满足时执行
elif score >= 60:
    print("及格")\t# 前两个条件不满足，条件3满足时执行
else:
    print("不及格")\t# 所有条件都不满足时执行
'''


time.sleep(0.5)
print(test1_msg)
time.sleep(0.5)
test1_1 = input(' 请问以上小测试1程序，有几个岔路口？')
while test1_1 != '4':
    print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
    test1_1 = input(' 以上小测试1程序，有几个岔路口？')
print('回答正确！法杖魔力值+1。')
print()

time.sleep(0.5)
print('在以上小测试1程序中，若score绑定的数据是85，')
test1_2 = input(' score = 85，会执行第几个分支任务呢？')
while test1_2 != '2':
    print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
    test1_2 = input('score = 85，会执行第几个分支任务呢？')
print('回答正确！法杖魔力值+1。')
print()


#知识点分割
print('**********************************************************')

msg_while1='''
勇士攻击！
小怪掉血。
勇士攻击！
小怪掉血。
勇士攻击！
小怪掉血。
……
小怪发表遗言
'''

msg_while2='''以下是勇士攻击小怪的程序片段：
little_monster_blood = 100\t#little_monster_blood表示小怪血量
while little_monster_blood>0:\t#满足  while  后面的判断条件，会循环执行 while 后面的程序片段
    print(“勇士攻击！”)
    little_monster_blood -= 15
print("小怪：算你厉害，我一定会回来的！啊~~~~~~")
'''
graList = ['~~~~~~~~~~~~~~~~~~~   while循环  ~~~~~~~~~~~~~~~~~~~',
           '勇士！在冒险的过程中，有的巡山小怪可能一击毙命，',
           '而有些中阶怪物却需要你不断进行攻击，直至怪物倒地不起，',
           '勇士偶遇满血小怪，',
           msg_while1,
           '在Python程序中，可以将“攻击-掉血”这样重复的过程写进循环里。',
           '小怪血量低于0，停止“攻击-掉血”的循环。',
           msg_while2,
           '程序中，while  是开启循环的守卫。',
           'while  守卫会严格检查数据是否满足条件，',
           '满足条件时，程序才会进入循环，',
           '且每执行一次循环里的内容，守卫  while  则会再次检查数据是否满足条件',
           '不满足条件时，程序就会退出循环不再回头。']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#while循环小测

msg_test2 = '''请阅读以下小测试2程序：
num = 10
while num>0:
    num-=3
print(num)
'''

time.sleep(0.5)
print(msg_test2)
time.sleep(0.5)
test2_1 = input(' 在以上小测试2程序中，num绑定什么值时，退出while循环？')
while test2_1 != '-2':
    print('很遗憾，回答错误！')
    test2_1 = input('请结合前面的内容或呼叫公主殿下，num绑定什么值时，退出while循环？')
print('回答正确！法杖魔力值+1。')
print()

time.sleep(0.5)
test2_2 = input(' 在以上小测试2程序中，print(num)输出的值是什么？')
while test2_2 != '-2':
    print('很遗憾，回答错误！')
    test2_2 = input('请结合前面的内容或呼叫公主殿下，print(num)输出的值是什么？')
print('回答正确！法杖魔力值+1')
print()


#知识点分割
print('**********************************************************')

msg_for1 = '''以下是模拟鸡排哥炸鸡排程序：
for i in range(100):
    print('正在炸第',i+1,'份鸡排……')
    print('鸡排炸好了，请您慢用')
'''
graList = ['~~~~~~~~~~~~~~~~~~~   for循环  ~~~~~~~~~~~~~~~~~~~',
           '与守卫  while  不同，for  可以比喻成程序界的鸡排哥',
           'for  开始工作时，需要数据提前有序排好队',
           '然后先处理第一个数据，再处理第二个数据，',
           '直到处理完数据队伍中的最后一个数据',
           msg_for1,
           '以上程序中，',
           'range(100)，是将100以内的非负整数进行排列，'
           '排好的队伍就是      0,1,2,3,4,5,......,99',
           'range使用的时候跟input、print一样，后面都有一对小括号，',
           '所以，range()也是一个函数，这个函数的功能就是生成序列',
           'range(5,100)  生成的序列是：5,6,7,8,9,......,99',
           'range(5,100,5)  生成的序列是：5,10,15,20,......,95']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#range()函数小测
time.sleep(0.5)
test3_1 = input('请问range(10)生成序列中，最大的数字是几？')
while test3_1 != '9':
    print('很遗憾，回答错误！')
    test3_1 = input('请结合前面的内容或呼叫公主殿下， 请问range(10)生成序列中，最大的数字是几？')
print('回答正确！法杖魔力值+1')
print()

time.sleep(0.5)
test3_2 = input(' 请问range(10)生成序列中，最小的数字是几？')
while test3_2 != '0':
    print('很遗憾，回答错误！')
    test3_2 = input('请结合前面的内容或呼叫公主殿下，请问range(10)生成序列中，最小的数字是几？')
print('回答正确！法杖魔力值+1')
print()

time.sleep(0.5)
test3_3 = input(' 请问range(2,16)生成序列中，最小的数字是几？')
while test3_3 != '2':
    print('很遗憾，回答错误！')
    test3_3 = input('请结合前面的内容或呼叫公主殿下， 请问range(2,15)生成序列中，最小的数字是几？')
print('回答正确！法杖魔力值+1')
print()

time.sleep(0.5)
test3_4 = input(' 请问range(2,16)生成序列中，最大的数字是几？')
while test3_4 != '15':
    print('很遗憾，回答错误！')
    test3_4 = input('请结合前面的内容或呼叫公主殿下， 请问range(2,16)生成序列中，最大的数字是几？')
print('回答正确！法杖魔力值+1')
print()

time.sleep(0.5)
test3_5 = input(' 请问想要生成一个  2,4,6,8 的序列，range(2,9,【1】)生成序列中，【1】应该替换为几？')
while test3_5 != '2':
    print('很遗憾，回答错误！')
    print('请结合前面的内容或呼叫公主殿下，')
    test3_5 = input('请问想要生成一个  2,4,6,8 的序列，range(2,9,【1】)生成序列中，【1】应该替换为几')
print('回答正确！法杖魔力值+1')
print()

graList = ['~~~~~~~~~~~~~~~~~~~   for循环  ~~~~~~~~~~~~~~~~~~~',
           msg_for1,
           '以上程序中，',
           '鸡排哥  for  后面的变量  i  会依次绑定rang(100)生成的序列中的数值，'
           '变量  i  依次绑定0,1,2,3,......,99',
           '数值从0开始，所以在炸鸡排的时候，需要使用 i+1 ，',
           '才会变成日常生活中常见的序列 1,2,3,4,......,100，']

for graStr in graList:
    time.sleep(2)
    print(graStr)

msg_test3 = '''以下是小测试4程序，模拟抄写单词20遍：
for a in range(1,21):
    print('正在抄写第',a,'遍')
    print('unbelievable，wonderful')
'''

time.sleep(0.5)
print(msg_test3)
test3_6 = input(' 请问以上小测试4程序中，哪个变量会依次绑定序列中的值？')
while test3_6 != 'a':
    print('很遗憾，回答错误！')
    print('请结合前面的内容或呼叫公主殿下，')
    test3_6 = input('请问以上小测试4程序中，哪个变量会依次绑定序列中的值？')
print('回答正确！法杖魔力值+1')
print()

print('法杖已获得了两种循环技能，一个是守卫  while  ，一个是鸡排哥  for  。')
time.sleep(0.5)
test3_7 = input(' 请问只知道循环停止条件，不知道循环次数，该使用while、for哪个循环技能呢？')
while test3_7 != 'while':
    print('很遗憾，回答错误！')
    print('请结合前面的内容或呼叫公主殿下，')
    test3_7 = input('请问只知道循环停止条件，不知道循环次数，该使用while、for哪个循环技能呢？')
print('回答正确！法杖魔力值+1')
print()


#知识点分割
print('**********************************************************')

print('恭喜！法杖魔力值已充满！')
input('勇士，分支  if  、循环守卫  while  、循环鸡排哥  for  ，你会用了吗？')
print('接下来，你可以选择向系统提问，也可打开新手第四个任务进行训练。')
