'''
本程序为木子编程系列课第三课示例程序
主要引导大家学习：
        运算符
帮助同学们对编程打下基础
'''
import time

print('勇士，欢迎回到程序世界！')
#第二小节：复习内容引导词
guide = ['恭喜你完成新手村前两个任务',
         '你已获得  五  项技能',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~   注释  ~~~~~~~~~~~~~~~~~~~~~',
         '        使用一对三引号，对在三引号中间的内容进行注释',
         '        使用“#”，对该符号后面的单行内容进行注释',
         '        被注释的内容将不会被运行，',
         '        注释的作用一般是对程序进行解释',
         '        暂不需要执行的代码也可使用注释将其屏蔽',
         '',
         '~~~~~~~~~~~~~~~  连接程序世界技能1  ~~~~~~~~~~~~~~~',
         '        输入函数：input()，括号内为提示内容，程序接收到用户输入的数据是字符串类型',
         '        输出函数：print()，括号内为需要输出的内容',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据类型  ~~~~~~~~~~~~~~~~~~~',
         '        整数类型 int ：正/负整数、0',
         '        浮点数类型 float ：小数',
         '        布尔类型 bool ：True/False',
         '        字符串类型 str ：使用一对单引号或者双引号包裹',
         '',
         '~~~~~~~~~~~~~~~~~~~~   变量  ~~~~~~~~~~~~~~~~~~~~~',
         '        变量通过“=”与数据进行绑定，',
         '        通过   变量名   可快速找到绑定的数据，',
         '        从而实现多次访问数据',
         '        变量名由字母、数字、下划线_组成',
         '        不能已数字开头，不能跟int、float等关键字重名',
         '',
         '~~~~~~~~~~~~~~~~~~~   类型转换  ~~~~~~~~~~~~~~~~~~~~',
         '        类型转换函数int()、float()、str()',
         '        int("123")    将字符串str“123”转换为int类型123',
         '        float("123")    将字符串str“123”转换为float类型123.0',
         '        str(123.0)    将float类型123.0转换为字符串str“123.0”',
         '',
         '技能展示完毕！']
#从引导词列表中逐句打印引导词
for guideStr in guide:
    time.sleep(2)
    print(guideStr)

time.sleep(0.5)
print()
input('接下来，你可以针对对以上技能向公主殿下询问使用方法，也可直接按下Enter键开启三关')

#模拟加载画面
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
time.sleep(0.1)
print()

#知识讲解
graList = ['勇士！数据在程序世界中有自己的运算规则，',
           '且不同派系规则不同',
           'Python派有四类简单的数据运算',
           '分别是：',
           '算术运算、关系运算、逻辑运算、赋值运算。',
           '~~~~~~~~~~~~~~~~~~~   算数运算  ~~~~~~~~~~~~~~~~~~~',
           '    用于数值运算、整数或者浮点数',
           '    加 +     减 -     乘  *    除 /    整除  //    取模  %      求幂  **',
           '    a = 10',
           '    b = 3',
           '    a + b\t#加法：13',
           '    a - b\t#减法：7',
           '    a * b\t#乘法：30',
           '    a / b\t#除法：3.333...（结果是浮点数）',
           '    a // b\t#整除：3（只取整数部分）',
           '    a % b\t#取模：1（取除法竖式运算的余数部分）',
           '    a ** b\t#幂运算：10的3次方']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#算术运算小测
time.sleep(0.5)
print('已知：x = 21 , y = 4 , z = 3 。请计算：')
time.sleep(0.5)
test1_1 = input(' x / y 运算结果是？')
while test1_1 != '5.25':
    print('很遗憾，回答错误！')
    test1_1 = input('请结合前面的内容或呼叫公主殿下， x / y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test1_2 = input(' x // y 运算结果是？')
while test1_2 != '5':
    print('很遗憾，回答错误！')
    test1_2 = input('请结合前面的内容或呼叫公主殿下， x // y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test1_3 = input(' x % y 运算结果是？')
while test1_3 != '1':
    print('很遗憾，回答错误！')
    test1_3 = input('请结合前面的内容或呼叫公主殿下， x % y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test1_4 = input(' y ** z 运算结果是？')
while test1_4 != '64':
    print('很遗憾，回答错误！')
    test1_4 = input('请结合前面的内容或呼叫公主殿下，  y ** z 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

#知识点分割
print('**************************************************')

graList = ['~~~~~~~~~~~~~~~~~~~   关系运算  ~~~~~~~~~~~~~~~~~~~',
           '    大于 >    小于  <    等于  ==    不等于  !=    大于等于  >=    小于等于  <=',
           '    运算结果为：True或False',
           '    关系成立，则结果为：True',
           '    关系不成立，则结果为：False']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#关系运算小测
time.sleep(0.5)
print('已知：x = 5 , y = 3 。请计算：')
time.sleep(0.5)
test2_1 = input(' x > y 运算结果是？')
while test2_1 != 'True':
    print('很遗憾，回答错误！')
    test2_1 = input('请结合前面的内容或呼叫公主殿下， x > y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test2_2 = input(' x == y 运算结果是？')
while test2_2 != 'False':
    print('很遗憾，回答错误！')
    test2_2 = input('请结合前面的内容或呼叫公主殿下， x == y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test2_3 = input(' x != y 运算结果是？')
while test2_3 != 'True':
    print('很遗憾，回答错误！')
    test2_3 = input('请结合前面的内容或呼叫公主殿下， x != y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test2_4 = input(' x <= y 运算结果是？')
while test2_4 != 'False':
    print('很遗憾，回答错误！')
    test2_4 = input('请结合前面的内容或呼叫公主殿下， x <= y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

#知识点分割
print('**************************************************')

graList = ['~~~~~~~~~~~~~~~~~~~   逻辑运算  ~~~~~~~~~~~~~~~~~~~',
           '    取反 not       与 and      或 or ',
           '    运算结果为：True或False',
           '    关系成立，则结果为：True',
           '    关系不成立，则结果为：False',
           '    not True\t结果为False',
           '    10>5 and 3<8\t结果为True（and运算，两边为True，结果才为True）',
           '    10>5 or 3>8\t结果为True（or运算，一边为True，结果为True）']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#逻辑运算小测
time.sleep(0.5)
print('已知：A = True，B = False，C = 3 > 2，D = 5 < 1。请计算：')
time.sleep(0.5)
test3_1 = input(' B and C 运算结果是？')
while test3_1 != 'False':
    print('很遗憾，回答错误！')
    test3_1 = input('请结合前面的内容或呼叫公主殿下， B and C 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test3_2 = input(' C or D 运算结果是？')
while test3_2 != 'True':
    print('很遗憾，回答错误！')
    test3_2 = input('请结合前面的内容或呼叫公主殿下， C or D 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test3_3 = input(' not A运算结果是？')
while test3_3 != 'False':
    print('很遗憾，回答错误！')
    test3_3 = input('请结合前面的内容或呼叫公主殿下， not A 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()


#知识点分割
print('**************************************************')

graList = ['~~~~~~~~~~~~~~~~~~~   赋值运算  ~~~~~~~~~~~~~~~~~~~',
           '     基础赋值（=）：',
           '\t先在内存中创建值对象，再将变量名绑定到该对象；',
           '\tb = a是让b与a绑定同一个对象，而非复制值。',
           '增强赋值（+=/*=等）：',
           '\t不可变对象（int/float/str）会创建新对象并重新绑定；',
           '\t n = 5\tn绑定对象5',
           '\tn += 2\t# 等价于n = n + 2 → n=7 ，n绑定新对象7',
           '\tn -= 1\t# 等价于n = n - 1 → n=6 ，n绑定新对象6',
           '\tn *= 3\t# 等价于n = n * 3 → n=18 ，n绑定新对象18',
           '\t可变对象（list/dict）则原地修改，不创建新对象。',
           '特殊赋值：',
           '\t链式赋值（x = y = z = 0）让多变量绑定同一对象；',
           '\t解包赋值（a, b = 10, 20）可快速绑定多变量，',
           '\t还能直接交换值（a, b = b, a）。']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#逻辑运算小测
time.sleep(0.5)
print('已知：a = 5，b = 10，c = 0。请计算：')
time.sleep(0.5)
test4_1 = input(' a+b 运行后，a绑定的数是？')
while test4_1 != '5':
    print('很遗憾，回答错误！')
    test4_1 = input('请结合前面的内容或呼叫公主殿下，a+b 运行后，a绑定的数是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test4_2 = input(' c = a+b 运行后，c绑定的数是？')
while test4_2 != '15':
    print('很遗憾，回答错误！')
    test4_2 = input('请结合前面的内容或呼叫公主殿下，c = a+b 运行后，c绑定的数是？')
print('回答正确！小刀锋利程度+1。')
print()

#知识点分割
print('**************************************************')

graList = ['~~~~~~~~~~~~~~~~~~~   运算优先级  ~~~~~~~~~~~~~~~~~~~',
           '运算优先级决定混合运算时的执行顺序，',
           '优先级高的先执行，优先级相同则从左到右依次执行；',
           '可通过括号改变优先级（括号优先级最高）',
           '1)括号：（），优先执行括号内的运算，是改变优先级最直接的方式，',
           '2)幂运算：**，优先级高于普通算术运算，',
           '\t示例：2+3**2=11（先算3²=9，再算2+9）。',
           '3)算术运算符：先乘除（*、/、//、%），后加减（+、-），',
           '\t示例：10-2*3=4（先算2*3=6，再算10-6）。',
           '4)比较运算符：>、<、==、!=、>=、<=，优先级低于算术运算符，',
           '\t示例：5+3>6  #True（先算5+3=8，再判断8>6）。',
           '5)逻辑运算符：先not，再and，最后or，',
           '\t示例：not 2>3 and 4<5  #True（先算not False #True，再算True and True  #True）。',
           '6)赋值运算符：=、+=、-=、*=等，优先级最低，所有运算执行完后再执行赋值']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#知识点分割
print('**************************************************')

print('恭喜！小刀已磨好！')
input('勇士，关于数据类型与变量，你会用了吗？')
print('接下来，你可以选择向系统提问，也可打开新手第三个任务进行训练。')
