'''
本程序为木子编程系列课第三课示例程序
主要引导大家学习：
        运算符
帮助同学们对编程打下基础
'''
import time

print('勇士，欢迎回到程序世界！')
#第二小节：复习内容引导词
guide = ['恭喜你完成新手村前两个任务',
         '你已获得  五  项技能',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~   注释  ~~~~~~~~~~~~~~~~~~~~~',
         '        使用一对三引号，对在三引号中间的内容进行注释',
         '        使用“#”，对该符号后面的单行内容进行注释',
         '        被注释的内容将不会被运行，',
         '        注释的作用一般是对程序进行解释',
         '        暂不需要执行的代码也可使用注释将其屏蔽',
         '',
         '~~~~~~~~~~~~~~~  连接程序世界技能1  ~~~~~~~~~~~~~~~',
         '        输入函数：input()，括号内为提示内容，程序接收到用户输入的数据是字符串类型',
         '        输出函数：print()，括号内为需要输出的内容',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据类型  ~~~~~~~~~~~~~~~~~~~',
         '        整数类型 int ：正/负整数、0',
         '        浮点数类型 float ：小数',
         '        布尔类型 bool ：True/False',
         '        字符串类型 str ：使用一对单引号或者双引号包裹',
         '',
         '~~~~~~~~~~~~~~~~~~~~   变量  ~~~~~~~~~~~~~~~~~~~~~',
         '        变量通过“=”与数据进行绑定，',
         '        通过   变量名   可快速找到绑定的数据，',
         '        从而实现多次访问数据',
         '        变量名由字母、数字、下划线_组成',
         '        不能已数字开头，不能跟int、float等关键字重名',
         '',
         '~~~~~~~~~~~~~~~~~~~   类型转换  ~~~~~~~~~~~~~~~~~~~~',
         '        类型转换函数int()、float()、str()',
         '        int("123")    将字符串str“123”转换为int类型123',
         '        float("123")    将字符串str“123”转换为float类型123.0',
         '        str(123.0)    将float类型123.0转换为字符串str“123.0”',
         '',
         '技能展示完毕！']
#从引导词列表中逐句打印引导词
for guideStr in guide:
    time.sleep(2)
    print(guideStr)

time.sleep(0.5)
print()
input('接下来，你可以针对对以上技能向公主殿下询问使用方法，也可直接按下Enter键开启三关')

#模拟加载画面
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
time.sleep(0.1)
print()

#知识讲解
graList = ['勇士！数据在程序世界中有自己的运算规则，',
           '且不同派系规则不同',
           'Python派有四类简单的数据运算',
           '分别是：',
           '算术运算、关系运算、逻辑运算、赋值运算。',
           '~~~~~~~~~~~~~~~~~~~   算数运算  ~~~~~~~~~~~~~~~~~~~',
           '    用于数值运算、整数或者浮点数',
           '    加 +     减 -     乘  *    除 /    整除  //    取模  %      求幂  **',
           '    a = 10',
           '    b = 3',
           '    a + b\t#加法：13',
           '    a - b\t#减法：7',
           '    a * b\t#乘法：30',
           '    a / b\t#除法：3.333...（结果是浮点数）',
           '    a // b\t#整除：3（只取整数部分）',
           '    a % b\t#取模：1（取除法竖式运算的余数部分）',
           '    a ** b\t#幂运算：10的3次方']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#算术运算小测
time.sleep(0.5)
print('已知：x = 21 , y = 4 , z = 3 。请计算：')
time.sleep(0.5)
test1_1 = input(' x / y 运算结果是？')
while test1_1 != '5.25':
    print('很遗憾，回答错误！')
    test1_1 = input('请结合前面的内容或呼叫公主殿下， x / y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test1_2 = input(' x // y 运算结果是？')
while test1_2 != '5':
    print('很遗憾，回答错误！')
    test1_2 = input('请结合前面的内容或呼叫公主殿下， x // y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test1_3 = input(' x % y 运算结果是？')
while test1_3 != '1':
    print('很遗憾，回答错误！')
    test1_3 = input('请结合前面的内容或呼叫公主殿下， x % y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test1_4 = input(' y ** z 运算结果是？')
while test1_4 != '64':
    print('很遗憾，回答错误！')
    test1_4 = input('请结合前面的内容或呼叫公主殿下，  y ** z 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

#知识点分割
time.sleep(2)
print('**************************************************')

graList = ['~~~~~~~~~~~~~~~~~~~   关系运算  ~~~~~~~~~~~~~~~~~~~',
           '    大于 >    小于  <    等于  ==    不等于  !=    大于等于  >=    小于等于  <=',
           '    运算结果为：True或False',
           '    关系成立，则结果为：True',
           '    关系不成立，则结果为：False']

for graStr in graList:
    time.sleep(2)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#关系运算小测
time.sleep(0.5)
print('已知：x = 5 , y = 3 。请计算：')
time.sleep(0.5)
test2_1 = input(' x > y 运算结果是？')
while test2_1 != 'True':
    print('很遗憾，回答错误！')
    test2_1 = input('请结合前面的内容或呼叫公主殿下， x > y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test2_2 = input(' x == y 运算结果是？')
while test2_2 != 'False':
    print('很遗憾，回答错误！')
    test2_2 = input('请结合前面的内容或呼叫公主殿下， x == y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test2_3 = input(' x != y 运算结果是？')
while test2_3 != 'False':
    print('很遗憾，回答错误！')
    test2_3 = input('请结合前面的内容或呼叫公主殿下， x != y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

time.sleep(0.5)
test2_4 = input(' x <= y 运算结果是？')
while test2_4 != 'False':
    print('很遗憾，回答错误！')
    test2_4 = input('请结合前面的内容或呼叫公主殿下， x <= y 运算结果是？')
print('回答正确！小刀锋利程度+1。')
print()

graList = ['~~~~~~~~~~~~~~~~~~~   逻辑运算  ~~~~~~~~~~~~~~~~~~~',
           '    取反 not       与 and      或 or ',
           '    运算结果为：True或False',
           '    关系成立，则结果为：True',
           '    关系不成立，则结果为：False',
           '    and：',]

graList = ['~~~~~~~~~~~~~~~~~~~   赋值运算  ~~~~~~~~~~~~~~~~~~~',
           '        整数类型int、浮点数类型float、布尔类型bool',
           '最常见的组合数据类型有：',
           '        字符串str、列表list、字典dict',
           '我们先从简单的开始。']


#知识点分割
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
time.sleep(0.1)
print()



print('恭喜！小刀已磨好！')
input('勇士，关于数据类型与变量，你会用了吗？')
print('接下来，你可以选择向系统提问，也可打开新手第二个任务进行训练。')
input()
