'''
本程序为木子编程系列课第六课示例程序
主要引导大家学习：
        函数基础
进一步深入编程世界
'''
import time

#自定义函数
'''
展示列表信息方法
msgList        需要打印输出的列表
stepTime    输出间隔时间
'''
def showMsg_list(msgList,stepTime):
    for msg in msgList:
        time.sleep(stepTime)
        print(msg)
    return True
        
'''
展示字符串方法
msg_str        需要打印输出的字符串
stepTime    输出间隔时间
'''
def showMsg_str(msg_str,stepTime):
    time.sleep(stepTime)
    print(msg_str)
    return True

'''
做小测试的方法
question        需要回答的问题
answer           问题的答案
award             答对问题的奖励
'''
def test(question,answer,award):
    time.sleep(0.5)
    test1_1 = input(question)
    while test1_1 != answer:
        print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
        test1_1 = input(question)
    print(award)
    print()
    return True

def print_sleep(msg,t):
    time.sleep(t)
    print(msg)

msg_data = '''        算术运算：
\t除:/（有小数）\t取整：//（商的整数部分）\t取模：%（取除法竖式运算的余数部分）\t求幂：**（10**3，结果为：1000，10的3次方）',
        关系运算：判断关系运算符两边数据的关系，运算结果为：True或False。',
        逻辑运算：not、and、or；运算结果为：True或False。',
        赋值运算：（=），符号右侧创建值对象后，将左边的变量与右边的值进行绑定。',
        运算优先级：',
\t算术运算>关系运算>逻辑运算>赋值运算，优先级高的先运算。
'''

msg_if1 = '''------------------  交警独自工作时  ----------------
if 条件:
    支线任务
'''
msg_if2 = '''------------------  交警携带辅警  else  时  ----------------
if 条件:
    支线任务1
else:
    支线任务2
'''
msg_if3 = '''------------------  交警携带多名辅警  else、elif  时  ----------------
if 条件1:
    支线任务1
elif 条件2:
    支线任务2
elif 条件3:
    支线任务3
else:
    支线任务4
'''

msg_while1 = '''----------------  不停判断，不停循环  --------------
while 循环条件：
        循环内容
'''

msg_for1 = '''----------------  依次访问序列中的数据  ----------------
for 循环控制变量 in 序列:
        循环内容
'''

msg_range = '''~~~~~~~~~~~~~~~~~~~~    整数序列  range    ~~~~~~~~~~~~~~~~~~~~
range(start,stop,step) ,
从 start 开始，到小于 stop的最大整数结束，间隔为step。step省略值为1。,
range(100) \t#生成的序列是：0,1,2,3,4,5,......,99,
range(5,100)  \t#生成的序列是：5,6,7,8,9,......,99,
range(5,100,5)  \t#生成的序列是：5,10,15,20,......,95.
'''
msg_list = '''~~~~~~~~~~~~~~~~~~~~    列表 list    ~~~~~~~~~~~~~~~~~~~~
使用一对英文的中括号[  ]，将多个数据围起来
并在中括号中使用英文的逗号，将这多个数据分开
使用下标的方式查找列表数据：list[下标]
有序、可修改、可重复
'''
msg_dict = '''~~~~~~~~~~~~~~~~~~~~    字典 dict   ~~~~~~~~~~~~~~~~~~~~
使用一对英文的大括号{  }，将多个键值对数据围起来
并在大括号中使用英文的逗号，将这多个键值对分开
键值对  写作     键（key） : 值（value）
无序、键唯一
'''
#前四小节：复习内容引导词
print('勇士，欢迎回到程序世界！')

guide = ['恭喜你完成新手村所有五个任务',
         '        你已获得：',
         '**********************    超大刀  六  项技能    **********************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~   注释——不运行的内容  ~~~~~~~~~~~~~~~~~~~~~',
         '        使用一对三引号，对在三引号中间的多行内容进行注释',
         '        使用“#”，对该符号后面的单行内容进行注释',
         '',
         '~~~~~~~~~~~~~~~  连接程序世界技能1  ~~~~~~~~~~~~~~~',
         '        输入、输出函数：input()、print()',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据类型  ~~~~~~~~~~~~~~~~~~~',
         '        整数类型 int、浮点数类型 float 、布尔类型 bool 、字符串类型 str ',
         '',
         '~~~~~~~~~~~~~~~~~~~~   变量  ~~~~~~~~~~~~~~~~~~~~~',
         '        变量通过“=”与数据进行绑定，',
         '        变量名由字母、数字、下划线_组成',
         '        不能已数字开头，不能跟int、float等关键字重名',
         '',
         '~~~~~~~~~~~~~~~~~~~   类型转换  ~~~~~~~~~~~~~~~~~~~~',
         '        类型转换函数int()、float()、str()',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据运算  ~~~~~~~~~~~~~~~~~~~~',
         msg_data,
         '',
         '**********************    法杖   四   项魔法技能    **********************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~    管理支线任务的交警 if    ~~~~~~~~~~~~~~~~~~~~',
         msg_if1,
         msg_if2,
         msg_if3,
         '',
         '~~~~~~~~~~~~~~~~~~~~    条件循环守卫 while    ~~~~~~~~~~~~~~~~~~~~',
         msg_while1,
         '判断条件，满足则执行循环内容，内容执行后，再判断条件，',
         '不满足条件退出循环',
         '',
         '~~~~~~~~~~~~~~~~~~~~    序列循环鸡排哥 for    ~~~~~~~~~~~~~~~~~~~~',
         msg_for1,
         '每次循环，循环控制变量依次绑定序列中的内容',
         '',
         '**********************  链蛇软剑  三项技能  **********************',
         msg_range,
         msg_list,
         msg_dict]

#从引导词列表中逐句打印引导词
showMsg_list(guide,1)

for i in range(5):
    time.sleep(0.5)
    print('咻~~~~~~',end='')

temList = [
    '',
    '~~~~~~~~~~~~~~~~~~    恭喜你！    ~~~~~~~~~~~~~~~~~',
    '~~~~~~~~~~~~  通过新手村的试炼！！！~~~~~~~~~~~~',
    '',
    '~~~~~~~~~~~~  解锁新道具：炼器炉  ~~~~~~~~~~~~~~',
    '接下来，你可以针对新手村的所有任务与技能向公主殿下询问使用方法，'
    ]
showMsg_list(temList,1)

time.sleep(1)
input('也可直接按下Enter键开启进阶任务训练。')

#模拟加载画面
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
print()

gramList_canshu = ['勇士！我们在新手村习得了一些函数技能',
            '连接程序世界的输入输出函数：','input()、print()',
            '数据类型转换函数：','int()、float()、str()',
            '集合操作函数：','len()、max()、min()、sum()',
            'range(start,stop,step)函数',
            '函数就是一段有名字、可重复使用、完成特定功能的代码块。',
            '函数可以实现模块化，将复杂的程序拆成一个个小功能，清晰好维护。',
            '~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~',
            '在新手村历练的过程中，',
            '我们经常使用函数',
            '比如：',
            'naichaName = input("请问你想喝点什么？") ',
            'print("您好！你的奶茶总计：",naichaPrice,"元！")',
            '在使用函数时，先写出了函数的名字，然后紧跟一对英文的小括号',
            '在小括号里，写入不同的内容，函数运行完后，呈现的效果是不一样的。',
            '这小括号里内容有个统一的名字，叫做：  参数  。',
            '参数可以有很多个，使用英文的逗号分隔.',
            '比如：range()函数',
            msg_range]

showMsg_list(gramList_canshu,2.5)

#参数测试
test('请问函数语句 range(5,100,5) 中有几个参数？','3','炼器炉火力值+1')

#使用函数测试
msg_test1 = '''以下是小测试1程序：
scores = [99,89,67,100,55]
max(scores)
'''
print_sleep(msg_test1,2)
test('在以上小测试1程序中，使用了哪个函数(请输入函数名)？','max','炼器炉火力值+1')

msg_hanshu1 = '''以下是攻击小怪
def daXiaoGuai():
    #实现函数功能的语句块
    print('攻击小怪')
    print('小怪掉血')
'''

msg_hanshu2 = '''以下是攻击小怪
#定义函数 daXiaoGuai
def daXiaoGuai():
    #实现函数功能的语句块
    print('攻击小怪')
    print('小怪掉血')

#使用函数 daXiaoGuai
daXiaoGuai()
'''

gramList_define = [
    '恭喜勇士，你已经会使用函数了！',
    '接下来，你将很轻松地拥有属于自己的函数',
    '~~~~~~~~~~~~~~~~~~~~~ 自定义函数 ~~~~~~~~~~~~~~~~~~~',
    '首先，你需要给你的函数取一个与他的功能有关的名字',
    '比如：打小怪 daXiaoGuai',
    '然后在名字前面写上关键字 def',
    'def daXiaoGuai',
    '紧接着在函数名后面加一对英文的小括号',
    'def daXiaoGuai()',
    '最后在小括号后面加一个英文的冒号,换行后，即可编写实现该函数功能的程序了',
    msg_hanshu1,
    '以上是简单的攻击小怪的方法',
    '定义了自己的函数以后，在程序中写函数名即可调用该函数',
    msg_hanshu2
    ]

showMsg_list(gramList_define,2.5)

test('请问以上daXiaoGuai()函数中，是否有参数(yes/no)?','no','炼器炉火力值+1')

gramList_return = [
    '勇士，在勇闯天涯的过程中，不同的小怪有不同的血量'
    ]


#知识点分割
print_sleep('********************************************************************',2)

print('恭喜！链蛇软剑攻击力已加满！')
print('接下来，你可以选择向系统提问，也可打开新手第五个任务进行训练。')
