'''
本程序为木子编程系列课第五课示例程序
主要引导大家学习：
        常用数据结构：列表、字典
帮助同学们对编程打下基础
'''
import time

print('勇士，欢迎回到程序世界！')

msg_if1 = '''------------------  交警独自工作时  ----------------
if 条件:
    支线任务
'''
msg_if2 = '''------------------  交警携带辅警  else  时  ----------------
if 条件:
    支线任务1
else:
    支线任务2
'''
msg_if3 = '''------------------  交警携带多名辅警  else、elif  时  ----------------
if 条件1:
    支线任务1
elif 条件2:
    支线任务2
elif 条件3:
    支线任务3
else:
    支线任务4
'''

msg_while1 = '''----------------  不停判断，不停循环  --------------
while 循环条件：
        循环内容
'''

msg_for1 = '''----------------  依次访问序列中的数据  ----------------
for 循环控制变量 in 序列:
        循环内容
'''
#前四小节：复习内容引导词
guide = ['恭喜你完成新手村前四个任务',
         '***************    你已获得超大刀的  六  项技能    ***************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~   注释——不运行的内容  ~~~~~~~~~~~~~~~~~~~~~',
         '        使用一对三引号，对在三引号中间的多行内容进行注释',
         '        使用“#”，对该符号后面的单行内容进行注释',
         '',
         '~~~~~~~~~~~~~~~  连接程序世界技能1  ~~~~~~~~~~~~~~~',
         '        输入、输出函数：input()、print()',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据类型  ~~~~~~~~~~~~~~~~~~~',
         '        整数类型 int、浮点数类型 float 、布尔类型 bool 、字符串类型 str ',
         '',
         '~~~~~~~~~~~~~~~~~~~~   变量  ~~~~~~~~~~~~~~~~~~~~~',
         '        变量通过“=”与数据进行绑定，',
         '        变量名由字母、数字、下划线_组成',
         '        不能已数字开头，不能跟int、float等关键字重名',
         '',
         '~~~~~~~~~~~~~~~~~~~   类型转换  ~~~~~~~~~~~~~~~~~~~~',
         '        类型转换函数int()、float()、str()',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据运算  ~~~~~~~~~~~~~~~~~~~~',
         '        算术运算：',
         '\t除:/（有小数）、取整：//（商的整数部分）、取模：%（取除法竖式运算的余数部分）',
         '\t求幂：**（10**3，结果为：1000，10的3次方）',
         '        关系运算：判断关系运算符两边数据的关系，运算结果为：True或False。',
         '        逻辑运算：not、and、or；运算结果为：True或False。',
         '        赋值运算：（=），符号右侧创建值对象后，将左边的变量与右边的值进行绑定。',
         '        运算优先级：',
         '\t算术运算>关系运算>逻辑运算>赋值运算，优先级高的先运算。',
         '',
         '***************    法杖的   四   项魔法技能    ***************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~    管理支线任务的交警 if    ~~~~~~~~~~~~~~~~~~~~',
         msg_if1,
         msg_if2,
         msg_if3,
         '',
         '~~~~~~~~~~~~~~~~~~~~    条件循环守卫 while    ~~~~~~~~~~~~~~~~~~~~',
         msg_while1,
         '判断条件，满足则执行循环内容，内容执行后，再判断条件，',
         '不满足条件退出循环',
         '',
         '~~~~~~~~~~~~~~~~~~~~    序列循环鸡排哥 for    ~~~~~~~~~~~~~~~~~~~~',
         msg_for1,
         '每次循环，循环控制变量依次绑定序列中的内容',
         '',
         '']

#从引导词列表中逐句打印引导词
for guideStr in guide:
    time.sleep(1)
    print(guideStr)

for i in range(6):
    time.sleep(0.5)
    print('嗞~~~~~~',end='')

time.sleep(2)
print()
print()
print('        ~~~~~~~~~~~~    解锁新道具：链蛇软剑！    ~~~~~~~~~~~~')

time.sleep(1)
print()
print('接下来，你可以针对对超大刀的所有技能向公主殿下询问使用方法，')
input('也可直接按下Enter键开启第五关，学习链蛇软剑技能')

#模拟加载画面
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
time.sleep(0.1)
print()

msg_list1 = '''-----------------------  水浒传一百单八将姓名列表 ------------------
[
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]
'''

msg_list2 = '''-----------------------  水浒传一百单八将姓名列表 heroes ------------------
heroes = [
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]
'''
#知识讲解
graList = ['勇士！以往超大刀的变量技能，只能绑定一个数据',
           '比如：',
           'name = "艾莎公主"',
           'age = 18',
           '那么类似水浒传一百单八将这么多个名字的数据该如何一次表示呢？',
           '程序世界中，使用一对英文的中括号，将多个数据围起来',
           '并在中括号中使用英文的逗号，将这多个数据分开',
           '比如：',
           msg_list1,
           '这样的数据表示方式称为 -----------   列表（list）  -----------',
           '如你所见，一个列表结构里可以存储多个数据',
           '而这一个列表，可以使用一个变量名进行绑定',
           msg_list2,
           '列表中数据如此多，程序运行时，该如何找到当中的数据呢？',
           '日常最简单的方式是，从1开始依次往后数，',
           '比如：heroes绑定的列表中第1个：宋江，第3个：吴用，第6个：林冲',
           '程序世界也是依次数往后数，',
           '不同的是：从0开始数',
           'heroes[0]    表示宋江',
           'heroes[2]    表示吴用',
           'heroes[5]    表示林冲',
           '列表结构在找数据的时候，在列表名字的后面写一对中括号，',
           '然后在中括号中写数字，这个数字叫做-------------  下标  ----------',
           '下标表示列表中数据与当前列表中第一个数据的偏移，',
           '偏移为0，表示第一个数据',
           '往后走一步，找到下一个数据，偏移就加1，',
           '所以看起来与日常生活不太一致']

for graStr in graList:
    time.sleep(2.5)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

time.sleep(0.5)
test1_1 = input(' 请问在以上heroes列表中，heroes[a]，下标a为几时，能找到数据  "柴进"  ？')
while test1_1 != '9':
    print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
    test1_1 = input(' 请问在以上heroes列表中，heroes[a]，下标a为几时，能找到数据  "柴进"  ？')
print('回答正确！链蛇软剑攻击力+1。')
print()


#知识点分割
print('**********************************************************')

graList = ['不会吧！不会吧！不会吧？',
           '上面的小测，你是一个个去数的吗？',
           '程序世界里，列表结构其实是有很多方法（函数）的，',
           '列表.index(要找的元素)  #可以查找某个元素在列表中第一次出现的位置',
           '所以想要知道"柴进"所在位置的下标',
           '先使用heroes.index("柴进")查到位置，再使用print()函数输出即可',
           'print(heroes.index("柴进"))   # 查找  柴进  的下标，输出结果为 9',
           'print(heroes.index("武松"))   # 查找  武松  的下标，输出结果为 13',
           'print(heroes.index("阮小七"))   # 查找   阮小七  的下标，输出结果为 30',
           'print(heroes.index("李二狗"))  # 查找  李二狗  的下标，',
           '结果会报错：ValueError: "李二狗"is not in list))    #"李二狗"不在列表中',
           '-----------------------------------------------------------------',
           '想在列表中加入数据，可以使用append()、insert()方法',
           '列表.append(元素)  #可以在列表的末尾添加元素',
           'heroes.append("李二狗")  #将"李二狗"添加到一百单八将姓名列表  heroes  的末尾',
           '列表.insert(下标, 要插入的元素)  #在列表指定下标位置插入一个元素，',
           'heroes.insert(0,"艾莎公主")  #在下标为0的位置插入，原来位置及后面的元素向后挪一位。',
           '列表还有其他很多  增、删、改、查、排序的方法，'
           '在探索程序世界的过程中，你会慢慢发现的。']

for graStr in graList:
    time.sleep(2.5)
    print(graStr)

time.sleep(0.5)
test2_1 = input(' 请问在以上heroes列表中，执行完  heroes.append("李二狗")  后，"李二狗"的下标为几呢？')
while test2_1 != '108':
    print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
    test2_1 = input(' 执行完  heroes.append("李二狗")  后，"李二狗"的下标为几呢？')
print('回答正确！链蛇软剑攻击力+1。')
print()

#知识点分割
print('**********************************************************')

msg_dict1 = '''-----------------------  武松个人信息字典 ------------------
{
    "姓名": "武松",
    "别名": ["武二郎", "行者", "武行者", "武都头"],
    "籍贯": "北宋 河北清河县（今河北邢台清河县）",
    "出生年月": "原著未记载确切日期，北宋年间",
    "去世": "杭州六和寺圆寂，寿八十",
    "身高": {
        "原著描述": "身长八尺",
        "宋尺换算(31.2cm/尺)": "约2.5米（文学夸张）",
        "汉尺换算(23.1cm/尺)": "约1.85米（现实合理）"
    },
    "梁山排名": 14,
    "星位": "天伤星",
    "梁山职位": "步军头领",
    "兵器": "雪花镔铁戒刀",
    "主要事迹": ["景阳冈打虎", "斗杀西门庆", "醉打蒋门神", "大闹飞云浦", "血溅鸳鸯楼", "征方腊断臂", "六和寺出家"],
    "封号": "清忠祖师"
}
'''

msg_dict2 = '''-----------------------  武松个人信息字典  wu_song  ------------------
wu_song = {
    "姓名": "武松",
    "别名": ["武二郎", "行者", "武行者", "武都头"],
    "籍贯": "北宋 河北清河县（今河北邢台清河县）",
    "出生年月": "原著未记载确切日期，北宋年间",
    "去世": "杭州六和寺圆寂，寿八十",
    "身高": {
        "原著描述": "身长八尺",
        "宋尺换算(31.2cm/尺)": "约2.5米（文学夸张）",
        "汉尺换算(23.1cm/尺)": "约1.85米（现实合理）"
    },
    "梁山排名": 14,
    "星位": "天伤星",
    "梁山职位": "步军头领",
    "兵器": "雪花镔铁戒刀",
    "主要事迹": ["景阳冈打虎", "斗杀西门庆", "醉打蒋门神", "大闹飞云浦", "血溅鸳鸯楼", "征方腊断臂", "六和寺出家"],
    "封号": "清忠祖师"
}
'''

graList = ['~~~~~~~~~~~~~~~~~~~  字典 dict  ~~~~~~~~~~~~~~~~~~~',
           '程序世界还有一种结构可以存储多个数据',
           '使用一对英文大括号{}将数据围起来，',
           '与  列表list  一样，使用英文的逗号，将这多个数据分开',
           '不同的是，字典 dict 中的数据是一个一个的键值对',
           '  键值对  写作     键（key） : 值（value）       ,',
           '需要注意：在一个   字典dict  中，键（key）不能重复。',
           msg_dict1,
           '与  列表list  一样，可以使用  赋值符号=  将字典数据绑定到变量里',
           msg_dict2,
           '字典dict   同样也有 增、删、改、查、排序的方法，'
           '在探索程序世界的过程中，你会慢慢发现的。']

for graStr in graList:
    time.sleep(2.5)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

#range()函数小测
time.sleep(0.5)
test3_1 = input('在程序世界中，使用一对英文的大括号{}围起来的数据，是什么类型的（用英文表示）?')
while test3_1 != 'dict':
    print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
    test3_1 = input(' 在程序世界中，使用一对英文的大括号{}围起来的数据，是什么类型的（用英文表示）?')
print('回答正确！链蛇软剑攻击力+1。')
print()

#知识点分割
print('**********************************************************')

graList = ['~~~~~~~~~~~~~~~~~~~   一对英文符号围起来的数据  ~~~~~~~~~~~~~~~~~~~',
           '一对英文引号\t单/双/三\t字符串str\t内容不可修改',
           '一对英文中括号\t[  ]\t列表list\t元素用英文的逗号分开，有序、可修改、可重复',
           '一对英文大括号\t{  }\t字典dict\t元素用英文的逗号分开，键值对、无序、键唯一',
           '可以使用内置函数 len() 获取这三种数据的元素个数',
           'len("abcdefghijklmnopqrstuvwxyz")  #获取字符串中的字符个数',
           'len(heroes)\t#获取一百单八将姓名列表的元素个数，也可称为：列表长度',
           'len(wu_song)\t#获取武松个人信息字典中的信息个数']

for graStr in graList:
    time.sleep(2.5)
    print(graStr)

#以下为小测试
time.sleep(1)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

msg_test4 = '''以下是小测试4程序，创建一天24小时温度的列表：
hourly_temp_24h = [
    17,  # 00:00
    16,  # 01:00
    16,  # 02:00
    16,  # 03:00
    17,  # 04:00
    17,  # 05:00
    18,  # 06:00
    18,  # 07:00
    18,  # 08:00
    18,  # 09:00
    17,  # 10:00
    16,  # 11:00
    17,  # 12:00
    18,  # 13:00
    20,  # 14:00
    21,  # 15:00
    22,  # 16:00
    22,  # 17:00
    21,  # 18:00
    20,  # 19:00
    19,  # 20:00
    17,  # 21:00
    16,  # 22:00
    15   # 23:00
]
'''

time.sleep(0.5)
test4_1 = input('使用什么函数，可以获取列表元素个数（写出函数的名字）？')
while test4_1 != 'len':
    print('很遗憾，回答错误！请结合前面的内容或呼叫公主殿下！')
    print('')
    test4_1 = input('使用什么函数，可以获取列表元素个数（写出函数的名字）？')
print('回答正确！链蛇软剑攻击力+1。')
print()

time.sleep(0.5)
print(msg_test4)
test4_2 = input(' 请问以上小测试4程序中，hourly_temp_24h列表的长度为多少？')
while test4_2 != '24':
    print('很遗憾，回答错误！请结合前面的内容或呼叫公主殿下！')
    print('')
    test4_2 = input('请问以上小测试4程序中，hourly_temp_24h列表的长度为多少？')
print('回答正确！链蛇软剑攻击力+1。')
print()

msg_test5 = '''以下是小测试5程序

#4月14日每小时的温度列表
hourly_temp_24h = [15, 14, 14, 13, 13, 12, 13, 14, 16, 18, 20, 21, 22, 22, 21, 20, 19, 18, 17, 17, 16, 16, 15, 15]
sumTem = 0
#计算当日总温度
for tem in hourly_temp_24h:
    sumTem+=tem

print(sumTem/len(hourly_temp_24h))

'''

time.sleep(0.5)
print(msg_test5)
test4_2 = input(' 请问以上小测试5程序中，最后输出的是当日的什么数据（用中文回答）？')
while test4_2 != '平均温度':
    print('很遗憾，回答错误！请结合前面的内容或呼叫公主殿下！')
    print('')
    test4_2 = input('请问以上小测试5程序中，最后输出的是当日的什么数据（用中文回答）')
print('回答正确！链蛇软剑攻击力+1。')
print()

#知识点分割
print('**********************************************************')

graList = ['~~~~~~~~~~~~~~~~~~~   遍历列表  ~~~~~~~~~~~~~~~~~~~',
           '小测试5程序中，使用了上一关的 for 循环结构',
           msg_for1,
           '小测试5程序中， in 后面的序列是4月14日每小时的温度列表 hourly_temp_24h',
           'for 后面的 tem 在循环中依次绑定 温度列表 hourly_temp_24h 的温度数据',
           '然后加到当日的总温度中',
           '最后使用 总温度sumTem除以hourly_temp_24h的元素个数',
           '最终得到当日的平均温度']

for graStr in graList:
    time.sleep(2.5)
    print(graStr)

#知识点分割
print()
time.sleep(2.5)
print('~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~')

print('恭喜！链蛇软剑攻击力已加满！')
print('接下来，你可以选择向系统提问，也可打开新手第五个任务进行训练。')
