'''
本程序为木子编程系列课第七课示例程序
主要引导大家学习：
        异常处理
进一步深入编程世界
'''
import time

#自定义函数
  
'''
睡眠打印字符串方法
msg_str        需要打印输出的字符串
stepTime    输出间隔时间
'''
def print_sleep(msg_str,stepTime):
    time.sleep(stepTime)
    print(msg_str)
    return True
    
'''
展示列表信息方法
msgList        需要打印输出的列表
stepTime    输出间隔时间
'''
def showMsg_list(msgList,stepTime):
    for msg in msgList:
        time.sleep(stepTime)
        print(msg)
    return True

'''
做小测试的方法
question        需要回答的问题
answer           问题的答案
award             答对问题的奖励
'''
def test(question,answer,award):
    print_sleep('^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^',2)
    test1_1 = input(question)
    while test1_1 != answer:
        print('很遗憾，回答错误！请结合前面的内容仔细观察或呼叫公主殿下！')
        test1_1 = input(question)
    print('回答正确!',award)
    print()
    return True

msg_data = '''        算术运算：
\t除:/（有小数）\t取整：//（商的整数部分）\t取模：%（取除法竖式运算的余数部分）\t求幂：**（10**3，结果为：1000，10的3次方）',
        关系运算：判断关系运算符两边数据的关系，运算结果为：True或False。',
        逻辑运算：not、and、or；运算结果为：True或False。',
        赋值运算：（=），符号右侧创建值对象后，将左边的变量与右边的值进行绑定。',
        运算优先级：',
\t算术运算>关系运算>逻辑运算>赋值运算，优先级高的先运算。
'''

msg_if1 = '''------------------  交警独自工作时  ----------------
if 条件:
    支线任务
'''
msg_if2 = '''------------------  交警携带辅警  else  时  ----------------
if 条件:
    支线任务1
else:
    支线任务2
'''
msg_if3 = '''------------------  交警携带多名辅警  else、elif  时  ----------------
if 条件1:
    支线任务1
elif 条件2:
    支线任务2
elif 条件3:
    支线任务3
else:
    支线任务4
'''

msg_while1 = '''----------------  不停判断，不停循环  --------------
while 循环条件：
        循环内容
'''

msg_for1 = '''----------------  依次访问序列中的数据  ----------------
for 循环控制变量 in 序列:
        循环内容
'''

msg_range = '''~~~~~~~~~~~~~~~~~~~~    整数序列  range    ~~~~~~~~~~~~~~~~~~~~
range(start,stop,step) ,
从 start 开始，到小于 stop的最大整数结束，间隔为step。step省略值为1。
'''
msg_list = '''~~~~~~~~~~~~~~~~~~~~    列表 list    ~~~~~~~~~~~~~~~~~~~~
使用一对英文的中括号[  ]，将多个数据围起来
并在中括号中使用英文的逗号，将这多个数据分开
使用下标的方式查找列表数据：list[下标]
有序、可修改、可重复
'''
msg_dict = '''~~~~~~~~~~~~~~~~~~~~    字典 dict   ~~~~~~~~~~~~~~~~~~~~
使用一对英文的大括号{  }，将多个键值对数据围起来
并在大括号中使用英文的逗号，将这多个键值对分开
键值对  写作     键（key） : 值（value）
无序、键唯一
'''
msg_f = '''~~~~~~~~~~~~~~~~~~~~    自定义函数   ~~~~~~~~~~~~~~~~~~~~
    关键字：def
    函数名：与函数功能相关
    参  数：写在函数名后的括号里，多个参数使用英文逗号分开
    返回值：return 函数运行后的结果
    在使用（调用）前定义函数
'''

#前六小节：复习内容引导词
print('勇士，欢迎回到程序世界！')

guide = ['恭喜你来到  第七关  ',
         '在之前的闯关任务中，你已获得：',
         '**********************    超大刀  六  项技能    **********************',
         '分别是：',
         '''~~~~~~~~~~~~~~~~~~~~   注释——不运行的内容  ~~~~~~~~~~~~~~~~~~~~~
         使用一对三引号，对在三引号中间的多行内容进行注释
         使用“#”，对该符号后面的单行内容进行注释''',
         '',
         '''~~~~~~~~~~~~~~~  连接程序世界技能1  ~~~~~~~~~~~~~~~
         输入、输出函数：input()、print()''',
         '',
         '''~~~~~~~~~~~~~~~~~~~   数据类型  ~~~~~~~~~~~~~~~~~~~
         整数类型 int、浮点数类型 float 、布尔类型 bool 、字符串类型 str ''',
         '',
         '''~~~~~~~~~~~~~~~~~~~~   变量  ~~~~~~~~~~~~~~~~~~~~~
         变量通过“=”与数据进行绑定，
         变量名由字母、数字、下划线_组成
         不能已数字开头，不能跟int、float等关键字重名''',
         '',
         '''~~~~~~~~~~~~~~~~~~~   类型转换  ~~~~~~~~~~~~~~~~~~~~
         类型转换函数int()、float()、str()''',
         '',
         '~~~~~~~~~~~~~~~~~~~   数据运算  ~~~~~~~~~~~~~~~~~~~~',
         msg_data,
         '',
         '**********************    法杖   四   项魔法技能    **********************',
         '分别是：',
         '~~~~~~~~~~~~~~~~~~~~    管理支线任务的交警 if    ~~~~~~~~~~~~~~~~~~~~',
         msg_if1,
         msg_if2,
         msg_if3,
         '',
         '~~~~~~~~~~~~~~~~~~~~    条件循环守卫 while    ~~~~~~~~~~~~~~~~~~~~',
         msg_while1,
         '判断条件，满足则执行循环内容，内容执行后，再判断条件，',
         '不满足条件退出循环',
         '',
         '~~~~~~~~~~~~~~~~~~~~    序列循环鸡排哥 for    ~~~~~~~~~~~~~~~~~~~~',
         msg_for1,
         '每次循环，循环控制变量依次绑定序列中的内容',
         '',
         '**********************  链蛇软剑  三项技能  **********************',
         msg_range,
         msg_list,
         msg_dict,
         '**********************  炼器炉  **********************',
         msg_f]

#从引导词列表中逐句打印引导词
showMsg_list(guide,1)

for i in range(5):
    time.sleep(0.5)
    print('咻~~~~~~',end='')

print_sleep('~~~~~~~~~~~~~~~  解锁新道具：拂尘  ~~~~~~~~~~~~~~~',2)
time.sleep(2)
input('勇士！你可以直接按下Enter键开启第七关任务，修炼新道具了。')

#模拟加载画面
for i in range(50):
    time.sleep(0.1)
    print('*',end='')
print()

#知识点分割
print_sleep('********************************************************************',2)
print_sleep('恭喜！炼器炉火力值已加满！',1)
print_sleep('接下来，你可以选择向系统提问，也可打开新手第六个任务进行训练。',1)
