'''
第七课练习：
    异常处理
try-except语法
    try:
        #尝试执行可能出现异常的代码
    except 异常类型:
        #异常出现时执行的代码
try-except-else语法
    try:
        #尝试执行可能出现异常的代码
    except 异常类型:
        #异常出现时执行的代码
    else:
        #异常未出现时执行的代码
'''

'''
水浒一百单八将的排名查找小程序：
    1)水浒一百单八将列表
    2)用户输入程序需要查找排名的英雄名
    3)查找排名，查到输出排名
              未查到输出不在一百单八将中。
    
    删除以下程序里的序号“【1】、【2】、【3】”，填写正确代码，让程序正常运行
'''
#英雄列表
heroes = [
    "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进",
    "李应", "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "戴宗",
    "刘唐", "李逵", "史进", "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺",
    "阮小七", "杨雄", "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
    "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国", "萧让", "裴宣", "欧鹏", "邓飞", "燕顺",
    "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全", "皇甫端", "王英", "扈三娘", "鲍旭",
    "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚", "马麟", "童威", "童猛", "孟康",
    "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
    "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆", "杜兴", "邹渊",
    "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇", "孙新",
    "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
]

print('你好！我可以查找水浒一百单八将的排名。')

hero = 【1】('请输入你想查找的英雄名字：')
try:
    _no = heroes.index(hero)
【2】 ValueError:
    print('很抱歉，英雄',hero,'不是宋江他们一边的。')
else:
    print(【3】,'在一百单八将中排名是：',_no+1)
